artillery/getinterestsperlevel.yaml
config:
  plugins:
    ensure: {}
  environments:
    develop:
      target: "https://wordbox-gateway-9qeed9h4.uc.gateway.dev"
      http:
        timeout: 10
        extendedMetrics: true
      payload:
        path: "levels.csv"
        fields:
          - "currentlevel"
        order: sequence
        skipHeader: true
  phases:
    - name: Warm up
      duration: 5
      arrivalRate: 5
    - name: Ramp up load
      duration: 60
      arrivalRate: 5
      rampTo: 10
  ensure:
    thresholds:
      - "http.response_time.p99": 5000
      - "http.response_time.p95": 2000
    conditions:
      - expression: "http.request_rate > 5"
    maxErrorRate: 1

before:
    flow:
      - log: "Get auth token"
      - post:
          name: "get_auth_token"
          url: "https://us-central1-wordboxdev.cloudfunctions.net/createcustomtoken"
          json:
            environment: "DEV"
          capture:
            - json: $.idToken
              as: token
      - log: "token => {{ token }}"

scenarios:
  - name: "Get interets per level"
    flow:
      - get:
          name: "get_interests_per_level"
          url: "/apis/v1/interest/levels"
          qs:
            currentlevel: "{{ currentlevel }}"
          headers:
            Accept: "application/json"
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$[0].level"
            as: "level"
          strict: false
      - log: "level => {{ level }}"