artillery/streakbyuser.yaml
config:
  environments:
    develop:
      target: "https://wordbox-gateway-9qeed9h4.uc.gateway.dev"
      processor: "functions.js"
      http:
        timeout: 20
        extendedMetrics: true
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    expect: {}
  phases:
    - duration: 2
      arrivalRate: 1
      name: Warm up
    #- name: Ramp up load
      #duration: 3
      #arrivalRate: 1
      #rampTo: 2
  payload:
    path: "users.csv"
    fields:
      - "userid"
    order: sequence
  ensure:
    thresholds:
      - "http.response_time.p99": 4000
      - "http.response_time.p95": 2000
    conditions:
      - expression: "http.request_rate > 5"
    maxErrorRate: 1

before:
    flow:
      - log: "Get auth token"
      - post:
          url: "https://us-central1-wordboxdev.cloudfunctions.net/createcustomtoken"
          json:
            environment: "DEV"
          capture:
            - json: $.idToken
              as: token
      - log: "token => {{ token }}"
scenarios:
  - name: "Streak by user"
    flow:
      - post:
          url: "/apis/v1/userstreak/streaksbyuser"
          beforeRequest:
            - "getCurrentDate"
          headers:
            Accept: "application/json"
            Authorization: "Bearer {{ token }}"
          json:
            userid: "{{ userid }}"
            currentdate: "{{ currentdate }}"
          capture:
            json: "$"
            as: "response"
          strict: false
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: currentstreak
      - log: "response => {{ response }}"