artillery/updateinterestsselectedbyuserid.yaml
config:
  plugins:
    ensure: {}
    metrics-by-endpoint:
      useOnlyRequestNames: true
  environments:
    develop:
      target: "https://wordbox-gateway-9qeed9h4.uc.gateway.dev"
      http:
        timeout: 10
        extendedMetrics: true
      payload:
        path: "users.csv"
        fields:
          - "userid"
        order: sequence
        skipHeader: true
  phases:
    - name: Warm up
      duration: 5
      arrivalRate: 5
    - name: Ramp up load
      duration: 60
      arrivalRate: 5
      rampTo: 10
  ensure:
    thresholds:
      - "http.response_time.p99": 10000
      - "http.response_time.p95": 5000
    conditions:
      - expression: "http.request_rate > 5"
    maxErrorRate: 1

before:
    flow:
      - log: "Get auth token"
      - post:
          name: "get_auth_token"
          url: "https://us-central1-wordboxdev.cloudfunctions.net/createcustomtoken"
          json:
            environment: "DEV"
          capture:
            - json: $.idToken
              as: token
      - log: "token => {{ token }}"

scenarios:
  - name: "Update interests selected by user id"
    flow:
      - get:
          name: "get_unlocked_interests_by_user_id"
          url: "/apis/v1/interest/unlocked"
          qs:
            userid: "{{ userid }}"
          headers:
            Accept: "application/json"
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$.items[0]"
              as: "interest1"
          strict: false
      - log: "interest1 => {{ interest1 }}"
      - put:
          name: "update_interests_selected_by_user_id"
          url: "/apis/v1/interest/selected"
          headers:
            Accept: "application/json"
            Authorization: "Bearer {{ token }}"
          json:
            userid: "{{ userid }}"
            interestselected:
              - interestid: "{{ interest1.id }}"
                selected: true
          capture:
            - json: "$.successful"
              as: "successful"
          strict: false
      - log: "successful => {{ successful }}"